Repository: lukasnetz/WebAuthn
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# login.link
source: Login with a security key
de: Login mit einem Sicherheitsschlüssel

# login.next
source: Next
de: Weiter

# labels_table_headline
source: Your registered security keys:
de: Ihre registrierten Sicherheitsschlüssel:

# labels_table_keydescr
source: Security key description
de: Sicherheitsschlüssel-Bezeichnung

# labels_table_date
source: Creation date
de: Erstelldatum

# labels_table_actions
source: Actions
de: Aktionen

# labels_register_key
source: Register security key
de: Sicherherheitsschlüssel registrieren

# labels_key_descr
source: Security key description
de: Sicherheitsschlüssel-Beschreibung

# button_login_loading
source: WebAuthn security key is being registered...
de: WebAuthn-Sicherheitsschlüssel wird registriert...

# labels_extension_descr
source: Checks whether the WebAuthn security key is valid
de: Überprüft ob der WebAuthn-Sicherheitssschlüssel gültig ist

# labels_extension_title
source: Use a security key with the WebAuthn Protocol
de: Einen Sicherheitsschlüssel mit dem WebAuthn-Protokoll verwenden

# labels_key_content
source: Security key content
de: Sicherheitsschlüssel-Inhalt

# template_headline_webauthn
source: WebAuthn security keys
de: WebAuthn-Sicherheitsschlüssel

# security_key_registered_success
source: Security key successfuly registered
de: Sicherheits-Schlüssel wurde erfolgreich registriert

# security_key_success_delete
source: Security key successfuly deleted
de: Der Datensatz wurde erfolgreich aus der Datenbank gelöscht

# js_error_key_registered
source: Security key is already registered
de: Sicherheits-Schlüssel ist schon vorhanden

# js_error_unspecified
source: An unspecified error occurred
de: Ein nicht bekannter Fehler ist aufgetreten

# js_confirm_question
source: Are you sure?
de: Sind Sie sich sicher?

# js_confirm_dialog
source: Are you sure you want to delete this record?
de: Sind Sie sich sicher ob sie diesen Eintrag löschen möchten?
